src/cf/InformationRegisters/НастройкиПодключенияЛокальныхМодулейИСМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПодключенияЛокальныхМодулейИСМП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АдресПодключенияЛМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбменНаСервере</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Таймаут</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьНастроенныеТоварныеГруппы</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьКоличествоДнейВыгрузкиКарточек</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СерверПодключенияЛМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортПодключенияЛМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗащищенноеСоединение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешСумма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВерсииФорматаОбменаЛокальногоМодуляИСМП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РабочиеМестаИС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/НастройкиПодключенияЛокальныхМодулейИСМП/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	УправлениеДоступомИСПереопределяемый.ПриЗаполненииОграниченияДоступа(
		Метаданные.РегистрыСведений.НастройкиПодключенияЛокальныхМодулейИСМП, Ограничение);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

// Функция возвращает прочитанный пароль администратора из безопасного хранилища по данным записи регистра
// 
// Параметры:
//  ХешСумма - Строка - хеш сумма настроек подключения, определяющие пароль
// 
// Возвращаемое значение:
//  Произвольный, Структура, Неопределено - Пароль администратора из безопасного хранилища
Функция ПарольАдминистратораИзБезопасногоХранилища(ХешСумма) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Пароль = ПрочитатьПарольАдминистратораИзБезопасногоХранилища(ХешСумма);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Пароль;
	
КонецФункции

// Процедура сохраняет пароль администратора в безопасное хранилище под данными регистра
// 
// Параметры:
//  ХешСумма - Строка - хеш сумма настроек подключения, определяющие пароль
//  Пароль - Строка - установленный пароль
Процедура СохранитьПарольАдминистратораВБезопасноеХранилище(ХешСумма, Пароль) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЗаписатьПарольАдминистратораВБезопасноеХранилище(ХешСумма, Пароль);
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Конструктор записи владельца пароля и расчета хеша
// 
// Возвращаемое значение:
//  Структура - Конструктор записи владельца пароля:
// * РабочееМесто - Произвольный, Неопределено - рабочее место
// * АдресПодключенияЛМ - Строка - строка подключения
Функция КонструкторЗаписиВладельцаПароля() Экспорт
	
	СтруктураВозврата = Новый Структура();
	
	СтруктураВозврата.Вставить("РабочееМесто",       ОбщегоНазначенияИС.ПустоеЗначениеОпределяемогоТипа(Метаданные.ОпределяемыеТипы.РабочиеМестаИС));
	СтруктураВозврата.Вставить("АдресПодключенияЛМ", "");
	
	Возврат СтруктураВозврата;
	
КонецФункции

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	
	Методы.Вставить("ОбработатьДанныеДляПереходаНаНовуюВерсиюЗаполнениеФорматаОбмена");
	Методы.Вставить("ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсиюЗаполнениеФорматаОбмена");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция НомерПриоритетаНастройкиПодключения(Организация, РабочееМесто) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	НастройкиПодключенияЛокальныхМодулейИСМП.Приоритет КАК Приоритет
		|ИЗ
		|	РегистрСведений.НастройкиПодключенияЛокальныхМодулейИСМП КАК НастройкиПодключенияЛокальныхМодулейИСМП
		|ГДЕ
		|	НастройкиПодключенияЛокальныхМодулейИСМП.Организация = &Организация
		|	И НастройкиПодключенияЛокальныхМодулейИСМП.РабочееМесто = &РабочееМесто
		|
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет УБЫВ";
	
	Запрос.УстановитьПараметр("Организация",  Организация);
	Запрос.УстановитьПараметр("РабочееМесто", РабочееМесто);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Приоритет + 1;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

#Область ОбновлениеИнформационнойБазы

Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсиюЗаполнениеФорматаОбмена(Параметры) Экспорт
	
	ДополнительныеПараметры = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
	ДополнительныеПараметры.ПолноеИмяРегистра = "РегистрСведений.НастройкиПодключенияЛокальныхМодулейИСМП";
	ДополнительныеПараметры.ЭтоНезависимыйРегистрСведений = Истина;
	
	Данные = Новый ТаблицаЗначений();
	СтрокаИзмерений = "";
	
	Для Каждого ИзмерениеРегистра Из Метаданные.РегистрыСведений.НастройкиПодключенияЛокальныхМодулейИСМП.Измерения Цикл
		Данные.Колонки.Добавить(ИзмерениеРегистра.Имя, ИзмерениеРегистра.Тип);
		СтрокаИзмерений = СтрокаИзмерений + ?(ЗначениеЗаполнено(СтрокаИзмерений), ", ", "") + ИзмерениеРегистра.Имя;
	КонецЦикла;
	
	ВерсияПодсистемыНаНачалоОбновления = Неопределено;
	
	Если Параметры <> Неопределено Тогда
		Параметры.Свойство("ВерсияПодсистемыНаНачалоОбновления", ВерсияПодсистемыНаНачалоОбновления);
	КонецЕсли;
	
	Если ВерсияПодсистемыНаНачалоОбновления = Неопределено Тогда
		ВерсияПодсистемыНаНачалоОбновления = ОбновлениеИнформационнойБазы.ВерсияИБ("БиблиотекаИнтеграцииИСМП");
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.СравнитьВерсии(ВерсияПодсистемыНаНачалоОбновления, "12.0.7.1") < 0 Тогда
		
		Данные_ЗаполнитьФорматОбмена = ДанныеКОбработкеДляПереходаНаНовуюВерсию_ЗаполнитьФорматОбменаПоУмолчанию();
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Данные_ЗаполнитьФорматОбмена, Данные);
		
	КонецЕсли;
	
	Данные.Свернуть(СтрокаИзмерений);
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Данные, ДополнительныеПараметры);
	
КонецПроцедуры

Функция ДанныеКОбработкеДляПереходаНаНовуюВерсию_ЗаполнитьФорматОбменаПоУмолчанию() Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	|	НастройкиПодключенияЛокальныхМодулейИСМП.Организация        КАК Организация,
	|	НастройкиПодключенияЛокальныхМодулейИСМП.РабочееМесто       КАК РабочееМесто,
	|	НастройкиПодключенияЛокальныхМодулейИСМП.Приоритет          КАК Приоритет,
	|	НастройкиПодключенияЛокальныхМодулейИСМП.АдресПодключенияЛМ КАК АдресПодключенияЛМ
	|ИЗ
	|	РегистрСведений.НастройкиПодключенияЛокальныхМодулейИСМП КАК НастройкиПодключенияЛокальныхМодулейИСМП
	|ГДЕ
	|	НастройкиПодключенияЛокальныхМодулейИСМП.ФорматОбмена = ЗНАЧЕНИЕ(Перечисление.ВерсииФорматаОбменаЛокальногоМодуляИСМП.ПустаяСсылка)";
	ТаблицаИзмерений = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаИзмерений;
	
КонецФункции

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсиюЗаполнениеФорматаОбмена(Параметры) Экспорт
	
	ПолноеИмяРегистра  = "РегистрСведений.НастройкиПодключенияЛокальныхМодулейИСМП";
	МетаданныеРегистра = Метаданные.РегистрыСведений.НастройкиПодключенияЛокальныхМодулейИСМП;
	
	ВерсияПодсистемыНаНачалоОбновления = Неопределено;
	
	Если Параметры <> Неопределено Тогда
		Параметры.Свойство("ВерсияПодсистемыНаНачалоОбновления", ВерсияПодсистемыНаНачалоОбновления);
	КонецЕсли;
	
	Если ВерсияПодсистемыНаНачалоОбновления = Неопределено Тогда
		ВерсияПодсистемыНаНачалоОбновления = ОбновлениеИнформационнойБазы.ВерсияИБ("БиблиотекаИнтеграцииИСМП");
	КонецЕсли;
	
	Выборка = ОбновлениеИнформационнойБазы.ВыбратьИзмеренияНезависимогоРегистраСведенийДляОбработки(Параметры.Очередь, ПолноеИмяРегистра);
	
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяРегистра);
			
			ЭлементБлокировки.УстановитьЗначение("Организация",  Выборка.Организация);
			ЭлементБлокировки.УстановитьЗначение("РабочееМесто", Выборка.РабочееМесто);
			ЭлементБлокировки.УстановитьЗначение("Приоритет",    Выборка.Приоритет);
			
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			Блокировка.Заблокировать();
			
			НаборЗаписей = СоздатьНаборЗаписей();
			
			НаборЗаписей.Отбор["Организация"].Установить(Выборка.Организация);
			НаборЗаписей.Отбор["РабочееМесто"].Установить(Выборка.РабочееМесто);
			НаборЗаписей.Отбор["Приоритет"].Установить(Выборка.Приоритет);
			
			НаборЗаписей.Прочитать();
			
			Для Каждого Запись Из НаборЗаписей Цикл
				Запись.ФорматОбмена = Перечисления.ВерсииФорматаОбменаЛокальногоМодуляИСМП.V1;
			КонецЦикла;
			
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			
			ТекстСообщения = НСтр("ru = 'Не удалось установить формат обмена по умолчанию по настройке ЛМ ЧЗ: %1 - % 2 по причине: %3'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, Выборка.Организация, ?(ЗначениеЗаполнено(Выборка.РабочееМесто), Выборка.РабочееМесто, НСтр("ru = '<без отбора по рабочему месту>'")), ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Предупреждение, МетаданныеРегистра,, ТекстСообщения);
			ВызватьИсключение;
			
		КонецПопытки;
		
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = Не ОбновлениеИнформационнойБазы.ЕстьДанныеДляОбработки(Параметры.Очередь, ПолноеИмяРегистра);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПрочитатьПарольАдминистратораИзБезопасногоХранилища(ХешСумма)
	
	Возврат ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(ХешСумма);
	
КонецФункции

Процедура ЗаписатьПарольАдминистратораВБезопасноеХранилище(ХешСумма, Пароль)
	
	ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(ХешСумма, Пароль);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
